<h1 style="text-align:center; font-size:160%; font-family:verdana;color:#F44A79;"><em>Date 21-06-2021</em></h1>

<h1 style="text-align:center; font-size:360%; font-family:verdana;color:#4A3E76;"><em>Build-in Functions and Methods in Pandas</em></h1>

---
# Functions in Pandas

In [1]:
import pandas as pd

In [2]:
titanic_data_csv=pd.read_csv('titanic_data.csv')
titanic_data_csv

     survived  pclass     sex   age  sibsp  parch     fare embarked deck
0           0       3    male  22.0      1      0   7.2500        S  NaN
1           1       1  female  38.0      1      0  71.2833        C    C
2           1       3  female  26.0      0      0   7.9250        S  NaN
3           1       1  female  35.0      1      0  53.1000        S    C
4           0       3    male  35.0      0      0   8.0500        S  NaN
..        ...     ...     ...   ...    ...    ...      ...      ...  ...
886         0       2    male  27.0      0      0  13.0000        S  NaN
887         1       1  female  19.0      0      0  30.0000        S    B
888         0       3  female   NaN      1      2  23.4500        S  NaN
889         1       1    male  26.0      0      0  30.0000        C    C
890         0       3    male  32.0      0      0   7.7500        Q  NaN

[891 rows x 9 columns]

In [3]:
type(titanic_data_csv)

pandas.core.frame.DataFrame

In [4]:
len(titanic_data_csv)

891

In [5]:
round(titanic_data_csv,0)

     survived  pclass     sex   age  sibsp  parch  fare embarked deck
0           0       3    male  22.0      1      0   7.0        S  NaN
1           1       1  female  38.0      1      0  71.0        C    C
2           1       3  female  26.0      0      0   8.0        S  NaN
3           1       1  female  35.0      1      0  53.0        S    C
4           0       3    male  35.0      0      0   8.0        S  NaN
..        ...     ...     ...   ...    ...    ...   ...      ...  ...
886         0       2    male  27.0      0      0  13.0        S  NaN
887         1       1  female  19.0      0      0  30.0        S    B
888         0       3  female   NaN      1      2  23.0        S  NaN
889         1       1    male  26.0      0      0  30.0        C    C
890         0       3    male  32.0      0      0   8.0        Q  NaN

[891 rows x 9 columns]

In [6]:
round(titanic_data_csv,3)

     survived  pclass     sex   age  sibsp  parch    fare embarked deck
0           0       3    male  22.0      1      0   7.250        S  NaN
1           1       1  female  38.0      1      0  71.283        C    C
2           1       3  female  26.0      0      0   7.925        S  NaN
3           1       1  female  35.0      1      0  53.100        S    C
4           0       3    male  35.0      0      0   8.050        S  NaN
..        ...     ...     ...   ...    ...    ...     ...      ...  ...
886         0       2    male  27.0      0      0  13.000        S  NaN
887         1       1  female  19.0      0      0  30.000        S    B
888         0       3  female   NaN      1      2  23.450        S  NaN
889         1       1    male  26.0      0      0  30.000        C    C
890         0       3    male  32.0      0      0   7.750        Q  NaN

[891 rows x 9 columns]

In [7]:
titanic_data_csv.shape

(891, 9)

In [8]:
titanic_data_csv.size

8019

In [9]:
titanic_data_csv.index

RangeIndex(start=0, stop=891, step=1)

---
# Methods in Pandas

In [10]:
titanic_data_csv.min()

survived         0
pclass           1
sex         female
age           0.42
sibsp            0
parch            0
fare             0
dtype: object

In [11]:
titanic_data_csv.mean()

survived     0.383838
pclass       2.308642
age         29.699118
sibsp        0.523008
parch        0.381594
fare        32.204208
dtype: float64

---
# Methods Chaining in Pandas

In [12]:
titanic_data_csv.mean().sort_values()

parch        0.381594
survived     0.383838
sibsp        0.523008
pclass       2.308642
age         29.699118
fare        32.204208
dtype: float64

In [13]:
titanic_data_csv.mean().sort_values().head(3)

parch       0.381594
survived    0.383838
sibsp       0.523008
dtype: float64